{
    "main": {
        "name": "Aaron Feingold",
        "occupation": "Software Developer",
        "description": "software developer, sommelier, and entrepreneur",
        "image": "profile-image.jpg",
        "bio": "I'm Aaron Feingold. A full-stack developer, sommelier, and entrepreneur based in New Orleans. My tech stack includes TypeScript, Next.js, FastAPI, PostgreSQL, and AWS.\n\nMy experience bridges the domains of fine wine and technology. I've also been a founder, and sales rep.\n\n I'm building a comprehensive knowledge base that provides instant confidence in wine selection.\n\n At Vino Vibes, we provide the path for sommelier-level wine selections intuitively. The platform helps diners move from uncertainty to educated choices, transforming overwhelming wine lists into opportunities for memorable experiences.\n\nMy approach centers on three core principles: Knowledge. Confidence. Experience.\n\nKnowledge: Creating educational tools that distill complex wine expertise into accessible insights. Confidence: Eliminating the guesswork and analysis paralysis that prevents people from exploring new wines. Experience: Building technology that enhances real-world dining moments rather than replacing them.\n\nMy technical foundation includes modern containerized deployments with Docker, infrastructure as code, and automated CI/CD pipelines. I prioritize observable, scalable systems that can grow with ambitious projects—whether that's handling thousands of wine pairing requests or supporting distributed development teams working on secure EC2 environments.\n\nBeyond Vino Vibes AI, I'm actively seeking full-stack development opportunities within innovative startups that value authentic problem-solving and technical excellence. I bring proven experience in building production-ready applications, leading technical initiatives, and a unique perspective shaped by years in both hospitality and technology sectors.\n\nCurrently, I'm expanding my technical toolkit to include workflow automation and advanced knowledge management systems, always with an eye toward creating solutions that empower rather than overwhelm users.\n\nIf you're interested in collaborating on meaningful technology projects, discussing startup opportunities, or simply connecting over our shared appreciation for well-crafted solutions, let's talk.",
        "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
        "email": "ajfeingold88@gmail.com",
        "phone": "555-555-5555",
        "address": {
            "street": "123 Some St.",
            "city": "New Orleans and New York",
            "state": "LA",
            "zip": "12345"
        },
        "backgroundImages": [
            "/images/header-bg-0.png",
            "/images/header-bg-1.png",
            "/images/header-bg-2.png",
            "/images/header-bg-4-founder.jpg"
        ],
        "defaultBackground": "/images/testimonials-bg.jpg",
        "imageSettings": {
            "/images/header-bg-3-founder.jpg": {
                "position": "center 30%",
                "style": {
                    "backgroundColor": "#000000"
                }
            }
        },
        "website": "https://a-feingold.medium.com/",
        "resumeDownload": "https://docs.google.com/document/d/1UUaSETqjqGsmDjEtcdo8aH_4lRoUYvIN4WSaDh3lS20/pub",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/aaron-feingold/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "github",
                "url": "https://github.com/aaronfeingold",
                "className": "fa fa-github"
            },
            {
                "name": "substack",
                "url": "https://aaronfeingold.substack.com/",
                "className": "social-icon",
                "imageSrc": "/images/social/substack.png"
            }
        ]
    },
    "resume": {
        "education": [
            {
                "school": "The Flatiron School",
                "url": "https://flatironschool.com/",
                "degree": "Full-stack Web Development",
                "graduated": "November 2020",
                "description": "React, Rails, and Postgresql"
            },
            {
                "school": "Tulane University",
                "degree": "Political Science and Latin American Studies",
                "graduated": "May 2010",
                "description": "Tulane was fine, but  New Orleans is awesome, so I never left"
            }
        ],
        "work": [
            {
                "company": "Vino Vibes",
                "title": "Founder",
                "location": "New Orleans, LA",
                "years": "Nov. 2024 - Present",
                "description": "Building the future of wine, one pairing at a time."
            },
            {
                "company": "Code Willing",
                "title": "Full-Stack Engineer",
                "location": "New Orleans, LA",
                "years": "Jan. 2023 - June 2024",
                "description": "Much as before, but now wearing many hats, leading a team, and engineering all the things."
            },
            {
                "company": "Code Willing",
                "title": "DevOps Engineer",
                "location": "New Orleans, LA",
                "years": "June 2021 - Jan. 2023",
                "description": "DevOps and MERN engineer creating a Big Data, cloud-based ML laboratory for HFT."
            },
            {
                "company": "KIPP Schools",
                "title": "Database Engineer",
                "location": "New Orleans, LA",
                "years": "April 2021 - June 2021",
                "description": "Built a Python mapper from scratch for MYSQL to aggregate data pipelines for state reporting"
            },
            {
                "company": "Republic National Distributing Company",
                "title": "On-Premise Sales Representative",
                "location": "New Orleans, LA",
                "years": "April 2015 - May 2020",
                "description": "Selling wine full time. One of the greatest jobs you could ever have."
            }
        ],
        "skillsMessage": "My Tech Stack, and the likelihood I'll use it any day",
        "skills": [
            {
                "name": "javascript",
                "desc": "JavaScript",
                "level": "100%"
            },
            {
                "name": "typescript",
                "desc": "TypeScript",
                "level": "100%"
            },
            {
                "name": "python",
                "desc": "Python",
                "level": "100%"
            },
            {
                "name": "git",
                "desc": "GitHub CI/CD",
                "level": "100%"
            },
            {
                "name": "reactjs",
                "desc": "React",
                "level": "100%"
            },
            {
                "name": "nodejs",
                "desc": "NodeJS",
                "level": "100%"
            },
            {
                "name": "nextjs",
                "desc": "NextJS",
                "level": "100%"
            },
            {
                "name": "linux",
                "desc": "Linux (Fedora/Ubuntu)",
                "level": "100%"
            },
            {
                "name": "mongodb",
                "desc": "MongoDB (NoSQL)",
                "level": "95%"
            },
            {
                "name": "postgresql",
                "desc": "PostgreSQL",
                "level": "95%"
            },
            {
                "name": "fastApi",
                "desc": "FastAPI",
                "level": "90%"
            },
            {
                "name": "docker",
                "desc": "Docker",
                "level": "80%"
            },
            {
                "name": "aws",
                "desc": "AWS",
                "level": "80%"
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "id": "1",
                "title": "vinovibes.ai",
                "category": "Food and Wine",
                "image": "vino-vibes.png",
                "url": "https://vinovibes.ai",
                "description": "Meet SIP the Owl, your sommelier in pocket. SIP by vino vibes is a platform that allows you to find the perfect wine for your vibe",
                "techStack": [
                    "Next.js",
                    "TailwindCSS",
                    "DrizzleORM",
                    "ChatGPT",
                    "LangGraph",
                    "FastAPI",
                    "Docker",
                    "AWS EC2",
                    "Scrapy",
                    "n8n",
                    "Supabase",
                    "Stripe",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-how-to-pitch?r=5htajo",
                "businessIdea": "VinoVibes democratizes fine wine by getting millennials and Gen Z excited about ordering wine at restaurants. Our AI sommelier, SIP the Owl, creates hyper-personalized wine recommendations based on your unique vibes—think favorite athlete (Adam Ondra), music taste (heavy metal), and even your zodiac sign (Pisces)—to select the perfect wine from any restaurant's list. The app eliminates analysis paralysis by providing instant, confident selections while tracking your wine journey and enabling social sharing with fellow vino vibers. Restaurant staff can also use SIP to overcome knowledge gaps, making expert-level recommendations without hiring a sommelier. By combining custom food-wine pairings, personal taste tracking, and vibe-based AI matching, we're making fine wine accessible to everyone while tangentially boosting restaurant wine sales. It's about giving people confidence in their selections and making the wine experience social, personal, and fun."
            },
            {
                "id": "2",
                "title": "festvibes.ai",
                "category": "Music and Events",
                "image": "fest-vibes.png",
                "url": "https://fest-vibes-nola.netlify.app/",
                "description": "Transform any day into a personalized music festival. A decentralized music discovery platform that helps users discover live local music, plan with friends, and create the ultimate festival experience. Features AI-powered event recommendations, social collaboration tools, venue insights, and community-driven music discovery for New Orleans music lovers.",
                "techStack": [
                    "Next.js",
                    "TypeScript",
                    "Supabase",
                    "Prisma",
                    "NeonDB",
                    "PostgreSQL",
                    "TailwindCSS",
                    "Python",
                    "Scrapy",
                    "Google Maps API",
                    "ChatGPT",
                    "Docker",
                    "AWS Lambda",
                    "AWS S3",
                    "AWS SNS",
                    "AWS SQS",
                    "AWS CloudWatch",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-building-the?r=5htajo",
                "businessIdea": "FestVibes.ai is a platform that democratizes music festival experiences by allowing users to create personalized, decentralized festivals using local venues and events. Combines AI-powered discovery with social planning tools to help music communities connect and discover live music experiences in their area."
            },
            {
                "id": "3",
                "title": "the-tchoupitoulas-data-challenge",
                "category": "Data Science and Analytics",
                "image": "tchoup-data-challenge.png",
                "url": "https://tchoupitoulas-data-challenge.vercel.app/",
                "description": "A comprehensive data analysis platform for the Creole Creamery Hall of Fame challenge. Built a full-stack application that scrapes, processes, and visualizes competition data using LLM-powered web scraping, machine learning predictions, and interactive dashboards. Features include automated data collection via AWS Lambda, predictive modeling for competition timing, and beautiful data visualizations with real-time analytics.",
                "techStack": [
                    "Next.js 15",
                    "TypeScript",
                    "PostgreSQL",
                    "Drizzle ORM",
                    "NeonDB",
                    "TailwindCSS",
                    "shadcn/ui",
                    "TanStack Query",
                    "Recharts",
                    "Python",
                    "scikit-learn",
                    "pandas",
                    "numpy",
                    "OpenAI GPT-4",
                    "BeautifulSoup4",
                    "AWS Lambda",
                    "AWS EventBridge",
                    "AWS ECR",
                    "Terraform",
                    "Docker",
                    "Poetry",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-building-the?r=5htajo",
                "businessIdea": "The Tchoupitoulas Data Challenge is a sophisticated data analytics platform that demonstrates end-to-end data science capabilities. It combines automated data collection, machine learning predictions, and interactive visualizations to analyze competition patterns. The project showcases real-world data engineering skills including LLM-powered web scraping, predictive modeling with limited data, and building production-ready data dashboards. Perfect for demonstrating full-stack data science capabilities and infrastructure automation."
            },
            {
                "id": "4",
                "title": "Ariba Property Tax Assessment Platform",
                "category": "Tax Services & Data Analytics",
                "image": "ariba.png",
                "url": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Status/418",
                "description": "A comprehensive property tax assessment analysis platform designed to streamline tax appeal processes for attorneys. Features advanced data visualization, AI-powered property analysis, interactive mapping, and automated report generation. The platform helps tax attorneys identify potential appeal cases by analyzing property valuations, comparing similar properties, and generating detailed assessment reports with comparable property analysis.",
                "techStack": [
                    "Next.js",
                    "TypeScript",
                    "React",
                    "Redux Toolkit",
                    "Redux Persist",
                    "Tailwind CSS",
                    "shadcn/ui",
                    "Radix UI",
                    "Recharts",
                    "Leaflet",
                    "React Grid Layout",
                    "Axios",
                    "JWT Decode",
                    "IndexedDB",
                    "React Window",
                    "TanStack Table",
                    "Lucide React",
                    "Sonner",
                    "NextAuth.js",
                    "Faker.js",
                    "ESLint",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-building-the?r=5htajo",
                "businessIdea": "Ariba is a specialized platform that revolutionizes property tax assessment analysis for tax attorneys. By combining comprehensive property data with advanced analytics, interactive visualizations, and AI-powered analysis tools, it helps attorneys identify potential tax appeal opportunities more efficiently. The platform processes large datasets of property records, provides detailed comparable property analysis, generates automated reports, and offers interactive dashboards for data exploration and client presentation."
            }
        ]
    }
}
