{
    "main": {
        "name": "Aaron Feingold",
        "occupation": "Software Developer",
        "description": "software developer, sommelier, and entrepreneur",
        "image": "profile-image.jpg",
        "bio": "I'm Aaron Feingold—a full-stack developer, wine aficionado, and entrepreneur based in New Orleans. My technical expertise spans Next.js, Express.js, MongoDB, FastAPI, PostgreSQL, and AWS, allowing me to build scalable web applications from frontend to backend and deploy them in the cloud.\n\nMy journey has taken me from the nuanced world of fine wines to the dynamic realm of technology, culminating in a mission to revolutionize how we experience wine through my venture, Vino Vibes AI.\n\nWith a foundation in full-stack development and a deep appreciation for viticulture, I've embarked on creating intelligent wine experiences that bridge the gap between vineyards, restaurants, and consumers. My platform leverages AI to develop tools that not only distribute quality wines efficiently but also democratize access to wine knowledge, making it an inclusive experience for all.\n\nMy mantra—Develop. Distribute. Democratize.—encapsulates this vision. It's about crafting experiential solutions that are as elegant as a fine Pinot Noir and as robust as a well-structured Cabernet, built with modern technologies like Next.js for seamless user experiences and FastAPI for performant backend services.\n\nBeyond my ventures, I'm seeking opportunities in full-stack development within startups that value innovation and authenticity. I bring to the table technical proficiency in modern web technologies, leadership experience, and a unique perspective shaped by years in both the wine industry and tech sector.\n\nIf you're interested in collaborating, investing, or simply sharing a glass of wine while discussing the future of tech-enabled experiences, let's connect.",
        "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
        "email": "ajfeingold88@gmail.com",
        "phone": "555-555-5555",
        "address": {
            "street": "123 Some St.",
            "city": "New Orleans and New York",
            "state": "LA",
            "zip": "12345"
        },
        "backgroundImages": [
            "/images/header-bg.jpg",
            "/images/header-bg-1.jpg",
            "/images/header-bg-2.jpg",
            "/images/header-bg-3-founder.jpg"
        ],
        "defaultBackground": "/images/testimonials-bg.jpg",
        "imageSettings": {
            "/images/header-bg-3-founder.jpg": {
                "position": "center 30%",
                "style": {
                    "backgroundColor": "#000000"
                }
            }
        },
        "website": "https://a-feingold.medium.com/",
        "resumeDownload": "https://docs.google.com/document/d/1UUaSETqjqGsmDjEtcdo8aH_4lRoUYvIN4WSaDh3lS20/pub",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/aaron-feingold/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "github",
                "url": "https://github.com/aaronfeingold",
                "className": "fa fa-github"
            },
            {
                "name": "substack",
                "url": "https://aaronfeingold.substack.com/",
                "className": "social-icon",
                "imageSrc": "/images/social/substack.png"
            }
        ]
    },
    "resume": {
        "education": [
            {
                "school": "The Flatiron School",
                "url": "https://flatironschool.com/",
                "degree": "Full-stack Web Development",
                "graduated": "November 2020",
                "description": "React, Rails, and Postgresql"
            },
            {
                "school": "Tulane University",
                "degree": "Political Science and Latin American Studies",
                "graduated": "May 2010",
                "description": "Tulane was fine, but  New Orleans is awesome, so I never left"
            }
        ],
        "work": [
            {
                "company": "Exclaim Recovery",
                "title": "Lead Full Stack Engineer",
                "years": "March 2025 - Present",
                "location": "New Orleans, LA",
                "description": "Spearheaded the design of a community recovery platform, focusing on mentor-mentee matching and progress tracking."
            },
            {
                "company": "inVino.io",
                "title": "Founder",
                "location": "New Orleans, LA",
                "years": "Nov. 2024 - Present",
                "description": "Building the future of wine, one app at a time."
            },
            {
                "company": "Code Willing",
                "title": "Full-Stack Engineer",
                "location": "New Orleans, LA",
                "years": "Jan. 2023 - June 2024",
                "description": "Much as before, but now wearing many hats, leading a team, and engineering all the things."
            },
            {
                "company": "Code Willing",
                "title": "DevOps Engineer",
                "location": "New Orleans, LA",
                "years": "June 2021 - Jan. 2023",
                "description": "DevOps and MERN engineer creating a Big Data, cloud-based ML laboratory for HFT."
            },
            {
                "company": "KIPP Schools",
                "title": "Database Engineer",
                "location": "New Orleans, LA",
                "years": "April 2021 - June 2021",
                "description": "Built a Python mapper from scratch for MYSQL to aggregate data pipelines for state reporting"
            },
            {
                "company": "Republic National Distributing Company",
                "title": "On-Premise Sales Representative",
                "location": "New Orleans, LA",
                "years": "April 2015 - May 2020",
                "description": "Selling wine full time. One of the greatest jobs you could ever have."
            }
        ],
        "skillsMessage": "My Tech Stack, and the likelihood I'll use it any day",
        "skills": [
            {
                "name": "javascript",
                "desc": "JavaScript",
                "level": "100%"
            },
            {
                "name": "typescript",
                "desc": "TypeScript",
                "level": "100%"
            },
            {
                "name": "python",
                "desc": "Python",
                "level": "100%"
            },
            {
                "name": "git",
                "desc": "GitHub CI/CD",
                "level": "100%"
            },
            {
                "name": "reactjs",
                "desc": "React",
                "level": "100%"
            },
            {
                "name": "nodejs",
                "desc": "NodeJS",
                "level": "100%"
            },
            {
                "name": "nextjs",
                "desc": "NextJS",
                "level": "100%"
            },
            {
                "name": "linux",
                "desc": "Linux (Fedora/Ubuntu)",
                "level": "100%"
            },
            {
                "name": "mongodb",
                "desc": "MongoDB (NoSQL)",
                "level": "95%"
            },
            {
                "name": "postgresql",
                "desc": "PostgreSQL",
                "level": "95%"
            },
            {
                "name": "fastApi",
                "desc": "FastAPI",
                "level": "90%"
            },
            {
                "name": "docker",
                "desc": "Docker",
                "level": "80%"
            },
            {
                "name": "aws",
                "desc": "AWS",
                "level": "80%"
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "id": "1",
                "title": "vinovibes.ai",
                "category": "Food and Wine",
                "image": "vino-vibes.png",
                "url": "https://vinovibes.ai",
                "description": "Meet SIP the Owl, your sommelier in pocket. SIP by vino vibes is a platform that allows you to find the perfect wine for your vibe",
                "techStack": [
                    "Next.js",
                    "TailwindCSS",
                    "DrizzleORM",
                    "ChatGPT",
                    "LangGraph",
                    "FastAPI",
                    "Docker",
                    "AWS EC2",
                    "Scrapy",
                    "n8n",
                    "Supabase",
                    "Stripe",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-how-to-pitch?r=5htajo",
                "businessIdea": "VinoVibes democratizes fine wine by getting millennials and Gen Z excited about ordering wine at restaurants. Our AI sommelier, SIP the Owl, creates hyper-personalized wine recommendations based on your unique vibes—think favorite athlete (Adam Ondra), music taste (heavy metal), and even your zodiac sign (Pisces)—to select the perfect wine from any restaurant's list. The app eliminates analysis paralysis by providing instant, confident selections while tracking your wine journey and enabling social sharing with fellow vino vibers. Restaurant staff can also use SIP to overcome knowledge gaps, making expert-level recommendations without hiring a sommelier. By combining custom food-wine pairings, personal taste tracking, and vibe-based AI matching, we're making fine wine accessible to everyone while tangentially boosting restaurant wine sales. It's about giving people confidence in their selections and making the wine experience social, personal, and fun."
            },
            {
                "id": "2",
                "title": "festvibes.ai",
                "category": "Music and Events",
                "image": "fest-vibes.png",
                "url": "https://fest-vibes-nola.netlify.app/",
                "description": "Transform any day into a personalized music festival. A decentralized music discovery platform that helps users discover live local music, plan with friends, and create the ultimate festival experience. Features AI-powered event recommendations, social collaboration tools, venue insights, and community-driven music discovery for New Orleans music lovers.",
                "techStack": [
                    "Next.js",
                    "TypeScript",
                    "Supabase",
                    "Prisma",
                    "NeonDB",
                    "PostgreSQL",
                    "TailwindCSS",
                    "Python",
                    "Scrapy",
                    "Google Maps API",
                    "ChatGPT",
                    "Docker",
                    "AWS Lambda",
                    "AWS S3",
                    "AWS SNS",
                    "AWS SQS",
                    "AWS CloudWatch",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-building-the?r=5htajo",
                "businessIdea": "FestVibes.ai is a platform that democratizes music festival experiences by allowing users to create personalized, decentralized festivals using local venues and events. Combines AI-powered discovery with social planning tools to help music communities connect and discover live music experiences in their area."
            },
            {
                "id": "3",
                "title": "the-tchoupitoulas-data-challenge",
                "category": "Data Science and Analytics",
                "image": "tchoup-data-challenge.png",
                "url": "https://tchoupitoulas-data-challenge.vercel.app/",
                "description": "A comprehensive data analysis platform for the Creole Creamery Hall of Fame challenge. Built a full-stack application that scrapes, processes, and visualizes competition data using LLM-powered web scraping, machine learning predictions, and interactive dashboards. Features include automated data collection via AWS Lambda, predictive modeling for competition timing, and beautiful data visualizations with real-time analytics.",
                "techStack": [
                    "Next.js 15",
                    "TypeScript",
                    "PostgreSQL",
                    "Drizzle ORM",
                    "NeonDB",
                    "TailwindCSS",
                    "shadcn/ui",
                    "TanStack Query",
                    "Recharts",
                    "Python",
                    "scikit-learn",
                    "pandas",
                    "numpy",
                    "OpenAI GPT-4",
                    "BeautifulSoup4",
                    "AWS Lambda",
                    "AWS EventBridge",
                    "AWS ECR",
                    "Terraform",
                    "Docker",
                    "Poetry",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-building-the?r=5htajo",
                "businessIdea": "The Tchoupitoulas Data Challenge is a sophisticated data analytics platform that demonstrates end-to-end data science capabilities. It combines automated data collection, machine learning predictions, and interactive visualizations to analyze competition patterns. The project showcases real-world data engineering skills including LLM-powered web scraping, predictive modeling with limited data, and building production-ready data dashboards. Perfect for demonstrating full-stack data science capabilities and infrastructure automation."
            },
            {
                "id": "4",
                "title": "Ariba Property Tax Assessment Platform",
                "category": "Tax Services & Data Analytics",
                "image": "ariba.png",
                "url": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Status/418",
                "description": "A comprehensive property tax assessment analysis platform designed to streamline tax appeal processes for attorneys. Features advanced data visualization, AI-powered property analysis, interactive mapping, and automated report generation. The platform helps tax attorneys identify potential appeal cases by analyzing property valuations, comparing similar properties, and generating detailed assessment reports with comparable property analysis.",
                "techStack": [
                    "Next.js",
                    "TypeScript",
                    "React",
                    "Redux Toolkit",
                    "Redux Persist",
                    "Tailwind CSS",
                    "shadcn/ui",
                    "Radix UI",
                    "Recharts",
                    "Leaflet",
                    "React Grid Layout",
                    "Axios",
                    "JWT Decode",
                    "IndexedDB",
                    "React Window",
                    "TanStack Table",
                    "Lucide React",
                    "Sonner",
                    "NextAuth.js",
                    "Faker.js",
                    "ESLint",
                    "Vercel"
                ],
                "blogUrl": "https://aaronfeingold.substack.com/p/from-rags-to-riches-building-the?r=5htajo",
                "businessIdea": "Ariba is a specialized platform that revolutionizes property tax assessment analysis for tax attorneys. By combining comprehensive property data with advanced analytics, interactive visualizations, and AI-powered analysis tools, it helps attorneys identify potential tax appeal opportunities more efficiently. The platform processes large datasets of property records, provides detailed comparable property analysis, generates automated reports, and offers interactive dashboards for data exploration and client presentation."
            }
        ]
    }
}
